#include <iostream>   // библиотека за input/output в конзолата
#include <Windows.h>  // библиотека използвана за манипулиране на конзолата
#include "Editor.h" // библиотека в която се намира едитора
#include "WindowsFunctions.h" //библиотека в която са дефинирани функции за манипулиране на конзолата

int main() {

	Editor::Application app; // създаваме обект от тип приложение
	app.Init(); // инициализираме приложението

	while (!app.IsReadyToExit()) { // проверяваме дали приложението не
                                    //е приключила и изпълняваме кода докато условието е истина
		app.Update();              //казваме на приложението да се ъпдейтне
	}

}
